#### Terraform Test Result: ✅ Pass
<details><summary>Show Test Logs</summary>

```text
test.tftest.hcl... in progress
  run "check_vpc_cidr_block"... pass
  run "check_subnets_config"... pass
  run "check_ec2_availability_zone"... pass
  run "check_ec2_instance_type"... pass
  run "check_rds_availability_zone"... pass
  run "check_rds_instance_class"... pass
  run "check_rds_engine"... pass
test.tftest.hcl... tearing down
test.tftest.hcl... pass

Success! 7 passed, 0 failed.

```

</details>

#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
aws_cloudwatch_log_group.waf_logs: Refreshing state... [id=aws-waf-logs-alb-alc]
aws_sns_topic.sns_topic_ec2: Refreshing state... [id=arn:aws:sns:ap-northeast-1:675175159712:EC2-CPU-Alarm-Topic]
data.aws_ssm_parameter.amazonlinux_2: Reading...
aws_vpc.terraform_vpc: Refreshing state... [id=vpc-0362da0e0a476a88e]
aws_s3_bucket.ansible_ssm_bucket: Refreshing state... [id=ansible-ssm-practice-raisetech]
aws_iam_role.ec2_ssm_role: Refreshing state... [id=ec2_ssm_role]
aws_wafv2_web_acl.terraform_alb_waf: Refreshing state... [id=3ae12488-822c-4443-9858-5d72398094b8]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2_ssm_role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
aws_iam_instance_profile.ec2_ssm_profile: Refreshing state... [id=ec2-ssm-profile]
data.aws_ssm_parameter.amazonlinux_2: Read complete after 1s [id=/aws/service/ami-amazon-linux-latest/al2023-ami-kernel-default-x86_64]
aws_sns_topic_subscription.sns_subscription_ec2: Refreshing state... [id=arn:aws:sns:ap-northeast-1:675175159712:EC2-CPU-Alarm-Topic:ae30230b-478a-493e-8e04-78d91a5d56ed]
aws_wafv2_web_acl_logging_configuration.waf_log_config: Refreshing state... [id=arn:aws:wafv2:ap-northeast-1:675175159712:regional/webacl/terraform-study-alb-waf/3ae12488-822c-4443-9858-5d72398094b8]
aws_internet_gateway.terraform_gw: Refreshing state... [id=igw-0be3ad1546e819a81]
aws_route_table.terraform_practice_routetable_private: Refreshing state... [id=rtb-067c073aa1009eb58]
aws_subnet.terraform_subnet["private-1a"]: Refreshing state... [id=subnet-04c80fdf60d19e9d3]
aws_security_group.terraform_alb_sg: Refreshing state... [id=sg-0d23007c259cc842f]
aws_subnet.terraform_subnet["public-1a"]: Refreshing state... [id=subnet-014ec7e675c0a4130]
aws_subnet.terraform_subnet["private-1c"]: Refreshing state... [id=subnet-05868f70177fa9f8d]
aws_subnet.terraform_subnet["public-1c"]: Refreshing state... [id=subnet-0a966137539d7765d]
aws_lb_target_group.terraform_alb_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:targetgroup/aws-study-alb-tg/2ea74eb9b96e995d]
aws_route_table.terraform_practice_routetable_public: Refreshing state... [id=rtb-06d757981cc72b519]
aws_security_group.terraform_ec2_sg: Refreshing state... [id=sg-06143680bfedac494]
aws_db_subnet_group.terraform_db_subnet_group: Refreshing state... [id=terraform-study-db-subnet-group]
aws_route_table_association.terraform_association["private-1c"]: Refreshing state... [id=rtbassoc-04025e87b96b764dd]
aws_route_table_association.terraform_association["public-1c"]: Refreshing state... [id=rtbassoc-0d0ee51dbcace8ed4]
aws_route_table_association.terraform_association["public-1a"]: Refreshing state... [id=rtbassoc-02b2846ad7f187aed]
aws_route_table_association.terraform_association["private-1a"]: Refreshing state... [id=rtbassoc-0b1672dcd886743fa]
aws_lb.terraform_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:loadbalancer/app/aws-study-alb/c311278d3a04f503]
aws_security_group.terraform_rds_sg: Refreshing state... [id=sg-0e6eea68f0b8d2ad7]
aws_instance.terraform_ec2: Refreshing state... [id=i-076c36398b05e7350]
aws_wafv2_web_acl_association.alb_waf_attach: Refreshing state... [id=arn:aws:wafv2:ap-northeast-1:675175159712:regional/webacl/terraform-study-alb-waf/3ae12488-822c-4443-9858-5d72398094b8,arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:loadbalancer/app/aws-study-alb/c311278d3a04f503]
aws_lb_listener.terraform_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:listener/app/aws-study-alb/c311278d3a04f503/a93cf7b152e6f0c6]
aws_db_instance.terraform_rds: Refreshing state... [id=db-ZFRKX2MEIOXVOW257WZBE7YDWU]
aws_lb_target_group_attachment.terraform_target_ec2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:targetgroup/aws-study-alb-tg/2ea74eb9b96e995d-20260219104257632800000002]
aws_cloudwatch_metric_alarm.ALERT_EC2_CPUUtilization: Refreshing state... [id=EC2-CPUUtilization-Alarm]
local_file.ansible_inventory: Refreshing state... [id=f7d1bb24e6f0a5c3563901507ac977a7bc081206]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.ansible_inventory will be created
  + resource "local_file" "ansible_inventory" {
      + content              = <<-EOT
            [web_servers]
            i-076c36398b05e7350 ansible_aws_ssm_instance_id=i-076c36398b05e7350
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./ansible/inventory/inventory.ini"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @nino-sann, Action: `pull_request`*